Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Comment>Должности сотрудников</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнглискоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксАвтосалона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРолиWA</Name>
					<Comment>Код уровня доступа в WA</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GRUPGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДТ_График</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_ДнейВСмену</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДТ_ДниВСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьМехаником</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/AD/Ext/Module.bsl
Функция СозадатьAD (Логин, ПарольПользователя, ОрганизационнаяЕдиница, UsGUID="") Экспорт
	
	ПутьОЕ = ПолучитьОргЕдиницуПоGUID (ОрганизационнаяЕдиница);
	
    фРезультат                    = Истина;
	
	Попытка    
		
		ОрганизационнаяЕдиницаОбъект        = ПолучитьCOMОбъект("LDAP://" + ПутьОЕ);
		
		ПользовательAD                      = ОрганизационнаяЕдиницаОбъект.Create("user", "CN=" + Логин);
		ПользовательAD.sAMAccountName       = Логин;
        ПользовательAD.userPrincipalName    = Логин + "@" +"sokolmotors.lan";
		
		ПользовательAD.pwdLastSet           = -1;
        ПользовательAD.description          = Логин;    
		//ПользовательAD.name                 = Логин;    
		ПользовательAD.SetInfo();
		ПользовательAD.SetPassword(ПарольПользователя);
                		
	Исключение
		
		фРезультат    = Ложь;
        ОписаниеОшибки    = ОписаниеОшибки();
		
	КонецПопытки;

       
    Если фРезультат Тогда
		
		ПользовательAD.AccountDisabled = Ложь;
        ПользовательAD.SetInfo();
		
		UsGUID = ПреобразоватьМассивВСтроку(ПользовательAD.objectGUID);

	КонецЕсли;

    Возврат фРезультат;
КонецФункции	

Функция ПреобразоватьSID(objectSid)
    SID    = "S-";
    
    МассивSID    = Новый Массив;
    Для Каждого ЭлементSID Из objectSid Цикл
        МассивSID.Добавить(ЭлементSID);
    КонецЦикла;
    //SID_REVISION
    SID    = SID + Строка(МассивSID[0]) + "-";
    
    КоличествоДашей    = МассивSID[1];
    
    SECURITY_NT_AUTHORITY    = 0;
    Для Инд = 0 По 5 Цикл
        SECURITY_NT_AUTHORITY    = SECURITY_NT_AUTHORITY + МассивSID[2 + Инд] * Pow(2, (5 - Инд) * 8);
    КонецЦикла;
    SID    = SID + Строка(SECURITY_NT_AUTHORITY);
    
    Для Инд = 0 По КоличествоДашей - 1 Цикл
        SID    = SID + "-";
        Даш    = 0;
        Для ИндДаш = 0 По 3 Цикл
            Даш    = Даш + МассивSID[8 + 4 * Инд + ИндДаш] * Pow(2, (ИндДаш) * 8);
        КонецЦикла;
        SID    = SID + Строка(Даш);
    КонецЦикла;
    
    Возврат SID;    
КонецФункции


Функция ПолучитьОргЕдиницуПоGUID (GUID) Экспорт 
	GUIDOb = СтрЗаменить("\"+GUID," ","\")  ;
	
	АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	АДОКоннектор.Open();
	
	КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	
	ДоменDNS = КореньDSE.Get("defaultNamingContext");
	
	ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE objectGUID='"+GUIDOb+"'";
	
	ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	
	Пока НЕ ВыборкаАДО.EOF Цикл
		
		ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		Попытка
			СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
			//СписокАтрибутов.GetInfo();
			Возврат СтрЗаменить(ПутьОбъекта,"LDAP://","");
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
	
КонецФункции	

Функция ГенераторПароля () Экспорт 
	пароль="";
	ГСЧ=Новый ГенераторСлучайныхЧисел();
	Для сч=1 по 8 Цикл
		слч=ГСЧ.СлучайноеЧисло(97,122);
		Если ((слч % 2) = 0 ) Тогда
			слч=ГСЧ.СлучайноеЧисло(0,9);
			Пароль=пароль+слч;
			Продолжить;
		КонецЕсли;
		Пароль=пароль+Символ(слч);
	КонецЦикла;	
	
	Возврат пароль;
КонецФункции	

Функция ДобавитьПользователяВГруппу(ПолноеИмяГруппыБезопасности,  ПутьПользователяAD, ОписаниеОшибки = "" ) Экспорт
    фРезультат                    = Истина;
    Попытка    
        ГруппаБезопасности            = ПолучитьCOMОбъект("LDAP://" + ПолноеИмяГруппыБезопасности);
        ГруппаБезопасности.Add("LDAP://" + ПутьПользователяAD);
        ГруппаБезопасности.SetInfo();
    Исключение
        фРезультат    = Ложь;
        ОписаниеОшибки    = ОписаниеОшибки();
    КонецПопытки;
    
    Возврат фРезультат;
КонецФункции

Функция УдалитьПользователяИзГруппы(ПолноеИмяГруппыБезопасности,  ПутьПользователяAD, ОписаниеОшибки = "" ) Экспорт
    фРезультат                    = Истина;
    Попытка    
        ГруппаБезопасности            = ПолучитьCOMОбъект("LDAP://" + ПолноеИмяГруппыБезопасности);
        ГруппаБезопасности.Remove("LDAP://" + ПутьПользователяAD);
        ГруппаБезопасности.SetInfo();
    Исключение
        фРезультат    = Ложь;
        ОписаниеОшибки    = ОписаниеОшибки();
    КонецПопытки;
    
    Возврат фРезультат;
КонецФункции

Функция ПолучитьСписокГруппУПользователя (GUID) Экспорт 
	МГрупп = Новый Массив;	
	Путь= ПолучитьОргЕдиницуПоGUID (GUID);
	
	АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	АДОКоннектор.Open();
	
	КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	
	ДоменDNS = КореньDSE.Get("defaultNamingContext");
	
	ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE member='"+Путь+"'";
	
	ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	
	Пока НЕ ВыборкаАДО.EOF Цикл
		
		ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		Попытка
			СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
			СписокАтрибутов.GetInfo();
			МГрупп.Добавить(ПреобразоватьМассивВСтроку(СписокАтрибутов.objectGUID));
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
	Если МГрупп.Количество() = 0 тогда
		Возврат Неопределено;	
	Иначе
		Возврат МГрупп;	
	КонецЕсли;	
КонецФункции	

Функция ПолучитьАтрибутПоGUID (GUID) Экспорт 
	GUIDOb = СтрЗаменить("\"+GUID," ","\")  ;
	
	АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	АДОКоннектор.Open();
	
	КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	
	ДоменDNS = КореньDSE.Get("defaultNamingContext");
	
	ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE objectGUID='"+GUIDOb+"'";
	
	ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	
	Пока НЕ ВыборкаАДО.EOF Цикл
		
		ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		Попытка
			СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
			СписокАтрибутов.GetInfo();
			Возврат СписокАтрибутов.OU;
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
	
КонецФункции

Функция ПолучитьCOMПоGUID (GUID) Экспорт 
	GUIDOb = СтрЗаменить("\"+GUID," ","\")  ;
	
	АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	АДОКоннектор.Open();
	
	КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	
	ДоменDNS = КореньDSE.Get("defaultNamingContext");
	
	ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE objectGUID='"+GUIDOb+"'";
	
	ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	
	Пока НЕ ВыборкаАДО.EOF Цикл
		
		ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		Попытка
			СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
			СписокАтрибутов.GetInfo();
			Возврат СписокАтрибутов;
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
	
КонецФункции

Функция ПоискПоЛогинуВAD(Логин) Экспорт 
	//	МГрупп = Новый Массив;	
	//Путь= ПолучитьОргЕдиницуПоGUID (GUID);
	
	АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	АДОКоннектор.Open();
	
	КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	
	ДоменDNS = КореньDSE.Get("defaultNamingContext");
	
	ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE sAMAccountName='"+Логин+"'";
	
	ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	
	Пока НЕ ВыборкаАДО.EOF Цикл
		
		ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		Попытка
			СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
			СписокАтрибутов.GetInfo();
			Возврат ПреобразоватьМассивВСтроку(СписокАтрибутов.objectGUID);
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат "";
		КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
	//Если МГрупп.Количество() = 0 тогда
	//	Возврат Неопределено;	
	//Иначе
	//	Возврат МГрупп;	
	//КонецЕсли;	
КонецФункции

Функция СоздатьГруппуБезопасности(ИмяГруппыБезопасности, ОрганизационнаяЕдиницаВладелец,GRUPGUID="",Описание="",     ПолноеИмяГруппыБезопасности = "",    SID = "",    ОписаниеОшибки = "" ,ПолноеИмя
    ) Экспорт
    фРезультат                    = Истина;
    //ADS_GROUP_TYPE_GLOBAL_GROUP        = 2;
    //ADS_GROUP_TYPE_DOMAIN_LOCAL_GROUP  = 4;
    //ADS_GROUP_TYPE_LOCAL_GROUP         = 4;
    //ADS_GROUP_TYPE_UNIVERSAL_GROUP     = 8;
    //ADS_GROUP_TYPE_SECURITY_ENABLED    = -2147483648;
    
	Попытка    
        ОрганизационнаяЕдиницаВладелецОбъект    = ПолучитьCOMОбъект("LDAP://" + ОрганизационнаяЕдиницаВладелец);
        ГруппаБезопасности            = ОрганизационнаяЕдиницаВладелецОбъект.Create("Group", "CN=" + ИмяГруппыБезопасности);
        ГруппаБезопасности.sAMAccountName    = ИмяГруппыБезопасности;
        ГруппаБезопасности.displayName        = ИмяГруппыБезопасности;
        ГруппаБезопасности.description        = Описание;
        ГруппаБезопасности.groupType        = -2147483646;//ADS_GROUP_TYPE_GLOBAL_GROUP + ADS_GROUP_TYPE_SECURITY_ENABLED; //глобальная группа
        ГруппаБезопасности.SetInfo();
	Исключение
	    фРезультат    = Ложь;
	    ОписаниеОшибки    = ОписаниеОшибки();
	КонецПопытки;
    
    Если фРезультат Тогда
		//SID    = ПреобразоватьSID(ГруппаБезопасности.objectSid);
        ПолноеИмя    = ГруппаБезопасности.distinguishedName;
		GRUPGUID = ПреобразоватьМассивВСтроку(ГруппаБезопасности.objectGUID);
    КонецЕсли;
    Возврат фРезультат;
КонецФункции

Функция ПреобразоватьМассивВСтроку(МассивГУИД)
	GUID = "";
	Для Каждого стр из МассивГУИД Цикл
		 GUID = GUID+" "+ Строка(DecToHex(стр));
	 КонецЦикла;
	 
	 Возврат СокрЛ(GUID);
 КонецФункции	
 
Функция ПолучитьАтрибут (GUID,АтрибутПоиска) Экспорт 
	 //Перем мТипы;
	 //Путь= ПолучитьОргЕдиницуПоGUID (GUID);
	 GUIDOb = СтрЗаменить("\"+GUID," ","\")  ;

	 АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	 АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	 АДОКоннектор.Open();
	 
	 КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	 
	 ДоменDNS = КореньDSE.Get("defaultNamingContext");
	 
	 ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE objectGUID='"+GUIDOb+"'";
	 
	 ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	 
	 Пока НЕ ВыборкаАДО.EOF Цикл
		 
		 ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		 //Попытка
		 СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
		 СписокАтрибутов.GetInfo();
		 //СписокАтрибутов.ЗначениеИзСтрокиВнутр(Атрибут) ;
		 //Возврат Неопределено;
		 КоличествоАтрибутов = СписокАтрибутов.PropertyCount;
		 
		 Для инд = 0 По КоличествоАтрибутов - 1 Цикл
			 Атрибут = СписокАтрибутов.item(инд);
			 //Сообщить("Значения атрибута: "+ Атрибут.Name+":");
			 Если Атрибут.Name = АтрибутПоиска тогда
				Для Каждого Значение Из Атрибут.Values Цикл
				 Попытка
				     ТекстЗначения = Значение.GetObjectProperty(Значение.ADsType);
					 //ТипЗначения = мТипы[Значение.ADsType];
					 //Сообщить(ТекстЗначения);
				     Возврат  ТекстЗначения;
				 Исключение
					КонецПопытки; 
			 КонецЦикла;
 
			КонецЕсли;	 
			 			 
			 //Сообщить(Символы.ПС);
		 КонецЦикла;
		//Исключение
		//	Сообщить(ОписаниеОшибки());      
		//	Возврат "";
		//КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
КонецФункции	

Функция DecToHex(Знач _Число)
	
	
	База = 16;
	
	
	Результат = "";
	
	
	Пока _Число <> 0 Цикл
		
		
		Поз =_Число % База;
		
		
		Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
		
		
		_Число = Цел(_Число / База);
		
		
	КонецЦикла;
	
	
	Возврат Результат;
	
	
КонецФункции // DecToHex()

Функция СоздатьГруппуИОргСтруктуру(GUID) Экспорт 
	distinguishedName = ПолучитьАтрибут (GUID,"distinguishedName") ;	 
	Если distinguishedName = "" тогда
		Сообщить("Ошибка получение COM объекта");	
	КонецЕсли;	
	
	СписокОЕИГрупп = РазложитьИПривестиКСтандарту(distinguishedName);
	
	ПредпоследняяГруппа = Справочники.Должности.ПустаяСсылка();
	Для Каждого  стр из СписокОЕИГрупп цикл
		OU = СтрЗаменить(стр,"OU=","");
		//ПоискOU = Справочники.Должности.НайтиПоНаименованию(OU);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование = &Наименование
		|	И Должности.Родитель = &Родитель";
		
		Запрос.УстановитьПараметр("Наименование", OU);
		Запрос.УстановитьПараметр("Родитель", ПредпоследняяГруппа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если  ВыборкаДетальныеЗаписи.Следующий() тогда
			ПоискOU = ВыборкаДетальныеЗаписи.Ссылка;
		Иначе
			ПоискOU = Справочники.Должности.ПустаяСсылка();
		КонецЕсли;
		
		Если ПоискOU = Справочники.Должности.ПустаяСсылка() тогда 
			GRUPGUID = ПоискGUIDпоOU(OU);
			ПолноеИмя = "";
			ОписаниеОшибки= "";
			ОЕ = Справочники.Должности.СоздатьГруппу();
			ОЕ.УстановитьНовыйКод();
			Если ПредпоследняяГруппа = Справочники.Должности.ДолжностиСоколМоторс тогда
				ОЕ.ПрефиксГорода = OU;
				ОЕ.Наименование = OU;
				
				ОЕ.ПолноеИмя = Ad.ПолучитьОргЕдиницуПоGUID(GRUPGUID);
				ОЕ.АнглискоеНаименование = AD.ПолучитьАтрибутПоGUID(GRUPGUID);
				ОЕ.GRUPGUID = GRUPGUID;
				ОЕ.Родитель = ПредпоследняяГруппа;
			КонецЕсли;
			
			Если ПредпоследняяГруппа <> Справочники.Должности.ДолжностиСоколМоторс тогда
				ОЕ.ПрефиксАвтосалона = OU;
				ОЕ.Наименование = OU;
				
				ОЕ.ПолноеИмя = Ad.ПолучитьОргЕдиницуПоGUID(GRUPGUID);
				ОЕ.АнглискоеНаименование = AD.ПолучитьАтрибутПоGUID(GRUPGUID);
				ОЕ.GRUPGUID = GRUPGUID;
				ОЕ.Родитель = ПредпоследняяГруппа;
				
			КонецЕсли;
			ОЕ.Записать();
			ПоискOU = ОЕ;
		КонецЕсли;	
		
		ПредпоследняяГруппа = ПоискOU;
	КонецЦикла;
	
	
	//GRUPGUID=  "";
	
	ГруппаAD = Справочники.Должности.СоздатьЭлемент();
	OU = ПолучитьАтрибут (GUID,"cn") ;
	
	ГруппаAD.GRUPGUID = ПоискGUIDпоOU(OU);
	
	ГруппаAD.УстановитьНовыйКод();
	ГруппаAD.Родитель = ПредпоследняяГруппа;
	ГруппаAD.ПрефиксГорода = OU;
	ГруппаAD.Наименование = OU;
	//АнглискоеНаименование = ПрефиксГорода;
	Попытка
		ГруппаAD.Псевдоним = ПолучитьАтрибут (GUID,"description");
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;	
	ГруппаAD.ПолноеИмя = Ad.ПолучитьОргЕдиницуПоGUID(ГруппаAD.GRUPGUID);
	ГруппаAD.АнглискоеНаименование = OU;
	ГруппаAD.Записать();
	Возврат ГруппаAD;
	
КонецФункции	 
 
Функция РазложитьИПривестиКСтандарту(Знач Стр, Разделитель = ",") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	СписокOU = Новый Массив;
	Для Каждого стр из Список цикл
		Если  Найти(Стр,"OU=")>0 тогда
			 СписокOU.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;
	СписокOUсорт = Новый Массив;

	Для н = 0 По СписокOU.Количество()-1 Цикл
	   индекс = СписокOU.Количество() - н - 1;
	   элемент = СписокOU[индекс];
	   СписокOUсорт.Добавить(элемент);
   КонецЦикла;
   
	Возврат СписокOUсорт;
	
КонецФункции //Разложить() 

Функция ПоискGUIDпоOU(OU) Экспорт 
		 //Перем мТипы;
	 //Путь= ПолучитьОргЕдиницуПоGUID (GUID);
	 
	 АДОКоннектор = Новый COMОбъект("ADODB.Connection");
	 АДОКоннектор.ConnectionString = "Provider=""ADsDSOObject""";
	 АДОКоннектор.Open();
	 
	 КореньDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
	 
	 ДоменDNS = КореньDSE.Get("defaultNamingContext");
	 
	 //ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE 	objectCategory='organizationalUnit'";
	  ТекстЗапроса = "select AdsPath from 'LDAP://"+ДоменDNS+"'  WHERE 	cn='"+OU+"'";

	 ВыборкаАДО = АДОКоннектор.Execute(ТекстЗапроса);
	 
	 Пока НЕ ВыборкаАДО.EOF Цикл
		 
		 ПутьОбъекта = ВыборкаАДО.Fields("AdsPath").Value;
		 //Попытка
		 СписокАтрибутов = ПолучитьCOMОбъект(ПутьОбъекта);
		 СписокАтрибутов.GetInfo();
		 //СписокАтрибутов.ЗначениеИзСтрокиВнутр(Атрибут) ;
		 Возврат ПреобразоватьМассивВСтроку(СписокАтрибутов.objectGUID);
		 //КоличествоАтрибутов = СписокАтрибутов.PropertyCount;
		 
		 //Для инд = 0 По КоличествоАтрибутов - 1 Цикл
		 //    Атрибут = СписокАтрибутов.item(инд);
		 //    Сообщить("Значения атрибута: "+ Атрибут.Name+":");
		 //    
		 //    Для Каждого Значение Из Атрибут.Values Цикл
		 //   	 Попытка
		 //   	     ТекстЗначения = Значение.GetObjectProperty(Значение.ADsType);
		 //   		 //ТипЗначения = мТипы[Значение.ADsType];
		 //   	     Сообщить(ТекстЗначения);
		 //   	     ОбработкаПрерыванияПользователя();
		 //   	 Исключение
		 //   		КонецПопытки; 
		 //    КонецЦикла;
		 //    
		 //    Сообщить(Символы.ПС);
		 //КонецЦикла;
		//Исключение
		//	Сообщить(ОписаниеОшибки());      
		//	Возврат "";
		//КонецПопытки;
		
		ВыборкаАДО.MoveNext();
	КонецЦикла;
	ВыборкаАДО.Close();
	АДОКоннектор.Close();
	
КонецФункции	

Функция СоздатьОрганизационнуюЕдиницу(ИмяОрганизационнойЕдиницы, ОрганизационнаяЕдиницаВладелец,GRUPGUID="", Описание="", ГруппаДелегат = "", ПолноеИмяОрганизационнойЕдиницы = "", ОписаниеОшибки = ""     ) Экспорт
    фРезультат                    = Истина;
	Попытка    
        ОрганизационнаяЕдиницаВладелецОбъект    = ПолучитьCOMОбъект("LDAP://" + ОрганизационнаяЕдиницаВладелец);
        ОрганизационнаяЕдиница            = ОрганизационнаяЕдиницаВладелецОбъект.Create("OrganizationalUnit", "OU=" + ИмяОрганизационнойЕдиницы);
        ОрганизационнаяЕдиница.description    = Описание;
        Если Не ПустаяСтрока(ГруппаДелегат) Тогда
            ОрганизационнаяЕдиница.managedBy    = ГруппаДелегат;
        КонецЕсли;
        
        ОрганизационнаяЕдиница.SetInfo();
	Исключение
	    фРезультат    = Ложь;
	    ОписаниеОшибки    = ОписаниеОшибки();
		
		
	КонецПопытки;
    Если фРезультат Тогда
        ПолноеИмя    = ОрганизационнаяЕдиница.distinguishedName;
		GRUPGUID = ПреобразоватьМассивВСтроку(ОрганизационнаяЕдиница.objectGUID);

    КонецЕсли;
    
    Возврат фРезультат;
КонецФункции
